; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v6 ?v7)
             (pred_4 ?v4 ?v10)
             (pred_7 ?v6 ?v10)
             (pred_6 ?v5 ?v6 )
	     (pred_12 ?v6)
             (pred_10 ?v9)
             (pred_11 ?v4)
             (pred_2 ?v10)
             (pred_1 ?v6)
             (pred_8 ?v4)
             (pred_5 ?v6)
             (pred_3 ))



(:action op_5
:parameters (?v1 ?v8 ?v11 ?v12)
:precondition (and (pred_10 ?v1) (pred_10 ?v8) (pred_11 ?v11) (pred_2 ?v12)
          (pred_9 ?v1 ?v8) (pred_4 ?v11 ?v12)
                   (pred_7 ?v8 ?v12) (pred_12 ?v1) 
                   (pred_1 ?v8) (pred_8 ?v11))
:effect (and  (pred_5 ?v8) (not (pred_1 ?v8))))


(:action op_3
:parameters (?v1 ?v2)
:precondition (and (pred_10 ?v1) (pred_10 ?v2)
               (pred_12 ?v1) (pred_9 ?v1 ?v2) (pred_5 ?v2))
:effect (and (pred_12 ?v2) (not (pred_12 ?v1))))

(:action op_1
:parameters (?v1 ?v11)
:precondition (and (pred_10 ?v1) (pred_11 ?v11) 
                  (pred_12 ?v1) (pred_6 ?v11 ?v1) (pred_3 ))
:effect (and (pred_8 ?v11)
   (not (pred_6 ?v11 ?v1)) (not (pred_3 ))))


(:action op_4
:parameters (?v1 ?v13 ?v3)
:precondition (and (pred_10 ?v1) (pred_11 ?v13) (pred_11 ?v3)
                  (pred_12 ?v1) (pred_8 ?v3) (pred_6 ?v13 ?v1))
:effect (and (pred_8 ?v13) (pred_6 ?v3 ?v1)
        (not (pred_8 ?v3)) (not (pred_6 ?v13 ?v1))))

(:action op_2
:parameters (?v1 ?v11)
:precondition (and (pred_10 ?v1) (pred_11 ?v11) 
                  (pred_12 ?v1) (pred_8 ?v11))
:effect (and (pred_3 ) (pred_6 ?v11 ?v1) (not (pred_8 ?v11)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_05 obj_19 obj_09 obj_18 obj_06 obj_14 obj_15 obj_21 obj_08 obj_07 obj_10 obj_11 obj_20 obj_16 obj_12 obj_13
    obj_02 obj_17
    obj_03 obj_01 obj_04
    )

    (:init
       (pred_3)

       (pred_10 obj_05)
       (pred_10 obj_19)
       (pred_10 obj_09)
       (pred_10 obj_18)
       (pred_10 obj_06)
       (pred_10 obj_14)
       (pred_10 obj_15)
       (pred_10 obj_21)
       (pred_10 obj_08)
       (pred_10 obj_07)
       (pred_10 obj_10)
       (pred_10 obj_11)
       (pred_10 obj_20)
       (pred_10 obj_16)
       (pred_10 obj_12)
       (pred_10 obj_13)
       (pred_2 obj_02)
       (pred_2 obj_17)
       (pred_11 obj_03)
       (pred_11 obj_01)
       (pred_11 obj_04)

       (pred_9 obj_05 obj_06)
       (pred_9 obj_05 obj_19)
       (pred_9 obj_19 obj_14)
       (pred_9 obj_19 obj_09)
       (pred_9 obj_19 obj_05)
       (pred_9 obj_09 obj_15)
       (pred_9 obj_09 obj_18)
       (pred_9 obj_09 obj_19)
       (pred_9 obj_18 obj_21)
       (pred_9 obj_18 obj_09)
       (pred_9 obj_06 obj_08)
       (pred_9 obj_06 obj_14)
       (pred_9 obj_06 obj_05)
       (pred_9 obj_14 obj_07)
       (pred_9 obj_14 obj_15)
       (pred_9 obj_14 obj_19)
       (pred_9 obj_14 obj_06)
       (pred_9 obj_15 obj_10)
       (pred_9 obj_15 obj_21)
       (pred_9 obj_15 obj_09)
       (pred_9 obj_15 obj_14)
       (pred_9 obj_21 obj_11)
       (pred_9 obj_21 obj_18)
       (pred_9 obj_21 obj_15)
       (pred_9 obj_08 obj_20)
       (pred_9 obj_08 obj_07)
       (pred_9 obj_08 obj_06)
       (pred_9 obj_07 obj_16)
       (pred_9 obj_07 obj_10)
       (pred_9 obj_07 obj_14)
       (pred_9 obj_07 obj_08)
       (pred_9 obj_10 obj_12)
       (pred_9 obj_10 obj_11)
       (pred_9 obj_10 obj_15)
       (pred_9 obj_10 obj_07)
       (pred_9 obj_11 obj_13)
       (pred_9 obj_11 obj_21)
       (pred_9 obj_11 obj_10)
       (pred_9 obj_20 obj_16)
       (pred_9 obj_20 obj_08)
       (pred_9 obj_16 obj_12)
       (pred_9 obj_16 obj_07)
       (pred_9 obj_16 obj_20)
       (pred_9 obj_12 obj_13)
       (pred_9 obj_12 obj_10)
       (pred_9 obj_12 obj_16)
       (pred_9 obj_13 obj_11)
       (pred_9 obj_13 obj_12)
       (pred_1 obj_11)
       (pred_1 obj_10)
       (pred_1 obj_16)
       (pred_7  obj_11 obj_02)
       (pred_7  obj_10 obj_17)
       (pred_7  obj_16 obj_17)
       (pred_5 obj_05)
       (pred_5 obj_19)
       (pred_5 obj_09)
       (pred_5 obj_18)
       (pred_5 obj_06)
       (pred_5 obj_14)
       (pred_5 obj_15)
       (pred_5 obj_21)
       (pred_5 obj_08)
       (pred_5 obj_07)
       (pred_5 obj_20)
       (pred_5 obj_12)
       (pred_5 obj_13)

       (pred_4  obj_03 obj_02)
       (pred_4  obj_01 obj_17)
       (pred_4  obj_04 obj_17)
       (pred_6 obj_03 obj_06)
       (pred_6 obj_01 obj_14)
       (pred_6 obj_04 obj_09)
       (pred_12 obj_21)
    )

    (:goal (and
       (pred_6 obj_01 obj_18)
    ))
(:constraints
  (always (not (pred_12 obj_15)))
)
)

; plan
1. (op_3 obj_21 obj_18)
   deleted: (pred_12 obj_21)
   added: (pred_12 obj_18)
   goals met: 0 of 1
2. (op_3 obj_18 obj_09)
   deleted: (pred_12 obj_18)
   added: (pred_12 obj_09)
   goals met: 0 of 1
3. (op_3 obj_09 obj_19)
   deleted: (pred_12 obj_09)
   added: (pred_12 obj_19)
   goals met: 0 of 1
4. (op_3 obj_19 obj_14)
   deleted: (pred_12 obj_19)
   added: (pred_12 obj_14)
   goals met: 0 of 1
5. (op_1 obj_14 obj_01)
   deleted: (pred_6 obj_01 obj_14) (pred_3)
   added: (pred_8 obj_01)
   goals met: 0 of 1
6. (op_3 obj_14 obj_19)
   deleted: (pred_12 obj_14)
   added: (pred_12 obj_19)
   goals met: 0 of 1
7. (op_3 obj_19 obj_09)
   deleted: (pred_12 obj_19)
   added: (pred_12 obj_09)
   goals met: 0 of 1
8. (op_3 obj_09 obj_18)
   deleted: (pred_12 obj_09)
   added: (pred_12 obj_18)
   goals met: 0 of 1
9. (op_2 obj_18 obj_01)
   deleted: (pred_8 obj_01)
   added: (pred_3) (pred_6 obj_01 obj_18)
   goals met: 1 of 1
